toitlang/qemu/hw/misc/esp32s3_sens.c
/*
 * ESP32 Sensor peripheral
 *
 * 
 *
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License version 2 or
 * (at your option) any later version.
 */

#include "qemu/osdep.h"
#include "qemu/log.h"
#include "qemu/error-report.h"
#include "qemu/guest-random.h"
#include "qapi/error.h"
#include "hw/hw.h"
#include "hw/sysbus.h"
#include "hw/misc/esp32s3_sens.h"

extern int touch_sensor[14];

extern uint32_t temp;

static uint64_t esp32_sens_read(void *opaque, hwaddr addr, unsigned int size)
{
//Esp32S3SensState *s = ESP32S3_SENS(opaque);
    uint32_t r = 0;
//    printf("esp32_sens_read %lx\n",addr);
    switch(addr) {
    case A_SENS_SAR_MEAS1_CTRL2_REG:
        return 0x10000+2800+rand()%4;
   case 0x50:
    return temp | (1<<8);
    case A_SENS_SAR_TOUCH_CHN_ST_REG:
	return (1<<31);
    }
// 2=gpio2, 3=gpio15, 4=gpio14(13?), 5=gpio12, 7=gpio27, 8=gpio33, 9=gpio32
// land +/- 300: 2=12166,31743 15=13618,31585 13=15277,31743 12=16798,31743 27=18388,3071 33=13791,2993 32=12166,2914
// port	       : 2=1417,12132  15=1339,13791  13=1496,15312  12=1417,16694  27=30010,18388 33=30088,13860 32=30010,12201

    if(addr>=0xa4 && addr<0xdc) {
	int n1=((addr-0xa4)/4);
        return ((1500-touch_sensor[n1]+rand()%20));
    }


//    qemu_guest_getrandom_nofail(&r, sizeof(r));
    return r;
}

static void esp32_sens_write(void *opaque, hwaddr addr, uint64_t value,
                                 unsigned int size) {
  //  Esp32S3SensState *s = ESP32S3_SENS(opaque);
  // if(addr==0x50)
  //       temp=(uint32_t)value;
  //  printf("esp32_sens_write %ld %ld\n",addr, value);
}

static const MemoryRegionOps esp32_sens_ops = {
    .read =  esp32_sens_read,
    .write = esp32_sens_write,
    .endianness = DEVICE_LITTLE_ENDIAN,
};

static void esp32_sens_init(Object *obj)
{
    Esp32S3SensState *s = ESP32S3_SENS(obj);
    SysBusDevice *sbd = SYS_BUS_DEVICE(obj);

    memory_region_init_io(&s->iomem, obj, &esp32_sens_ops, s,
                          TYPE_ESP32S3_SENS, 0x400);
    sysbus_init_mmio(sbd, &s->iomem);
}


static const TypeInfo esp32_sens_info = {
    .name = TYPE_ESP32S3_SENS,
    .parent = TYPE_SYS_BUS_DEVICE,
    .instance_size = sizeof(Esp32S3SensState),
    .instance_init = esp32_sens_init,
};

static void esp32_sens_register_types(void)
{
    type_register_static(&esp32_sens_info);
}

type_init(esp32_sens_register_types)
